from django.shortcuts import render

# Create your views here.


def index(req):
    return render(req, 'index.html')


def cosmo(req, name):
    if name == 'astronaut':
        k1 = 'Юрий Алексеевич Гагарин'
        k2 = 'img/astronaut2.jpeg'
        k3 = 'Профессия космонавта — не для слабаков. Только лучшие из лучших способны стать покорителями космического пространства, но всё равно все они идут по стопам первого человека в космосе — Юрия Гагарина. Именно Гагарин навсегда вошёл в учебники истории, как первый житель нашей планеты, побывавший в космосе, и именно поэтому он никогда не будет забыт.'
        k4 = 'https://ru.wikipedia.org/wiki/Гагарин,_Юрий_Алексеевич'
    elif name == 'moon':
        k1 = 'Луна'
        k2 = 'img/moon2.jpeg'
        k3 = 'Луна — пока что единственное небесное тело, на котором побывал человек, и о ней мы знаем очень многое.'
        k4 = 'https://ru.wikipedia.org/wiki/Луна'
    elif name == 'sun':
        k1 = 'Сонце'
        k2 = 'img/sun2.jpeg'
        k3 = 'Солнце — самый крупный и самый массивный объект в Солнечной системе. Также это единственная звезда нашей Солнечной системы. Теория о том, что оно является центром, вокруг которого вращаются другие планеты была предложена ещё в 3-м веке до нашей эры.'
        k4 = 'https://ru.wikipedia.org/wiki/Солнце'
    elif name == 'space':
        k1 = 'Космическое пространство'
        k2 = 'img/space2.jpeg'
        k3 = 'Наша Вселенная – это неповторимое место, которое человек пытается понять на протяжении всей своей истории. Хотя человечество прошло долгий путь исследования космоса, все новые и новые «космические» открытия совершаются ежедневно. И неважно, что это — алкогольное облако в центре Вселенной или Теория Относительности Эйнштейна – каждая такая находка дает обширное поле для работы астрофизикам. Все это также интересно и людям, чья профессия не связана с астрономией.'
        k4 = 'https://ru.wikipedia.org/wiki/Космическое_пространство'
    elif name == 'station':
        k1 = 'Международная космическая станция'
        k2 = 'img/cosmo2.jpeg'
        k3 = 'Вершиной современной науки является МКС, Международная космическая станция, вращающаяся на орбите вокруг Земли. С её помощью учёным удалось сделать огромное количество важнейших открытий, а в создании и поддержании работоспособности станции принимают участие самые разные страны.'
        k4 = 'https://ru.wikipedia.org/wiki/Международная_космическая_станция'
    data = {'titile': k1, 'photo': k2, 'desc': k3, 'more': k4}
    return render(req, 'cosmo.html', data)

